tutorials/validations4NFFoam/naturalConvection_NEPCM_Ghalambaz/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 2 -2 0 0 0 0];

internalField		uniform 0;

boundaryField
{
    ".*"
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }
}


// ************************************************************************* //
